backend/controllers/PricingController.php

    protected function findModel($id)
    {
        if (($model = Pricing::findOne($id)) !== null) {
---
SELECT * FROM `pricing` WHERE `id`='1'