frontend/controllers/ConsumerController.php

SELECT * FROM `consumer` WHERE `user_id`=9
---
    public function actionCreate()
    {
        $check = Consumer::find()->where([
            'user_id' => Yii::$app->user->identity->id
        ])->one();