frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $this->layout = 'home';
        if (! Yii::$app->user->isGuest) {
            $check = Consumer::find()->where([
                'user_id' => Yii::$app->user->identity->id
            ])->one();
---
SELECT * FROM `consumer` WHERE `user_id`=9

    public function actionPricing($product_id)
    {
        $prices = Pricing::find()->where(['product_id'=>$product_id])->all();
---
SELECT * FROM `pricing` WHERE `product_id`='1'

    public function actionService($id)
    {
        $service = Solution::findOne($id);
---
SELECT * FROM `solution` WHERE `id`='2'

    public function actionStripe()
    {
        $amount = 10000;
        if (isset($_POST['stripeToken'])) {
            // Set your secret key: remember to change this to your live secret key in production
            // See your keys here: https://dashboard.stripe.com/account/apikeys
            \Stripe\Stripe::setApiKey("sk_test_RABF55bjr4hHYMjnwHVnhZHz");

            // Token is created using Checkout or Elements!
            // Get the payment token ID submitted by the form:
            $token = $_POST['stripeToken'];
            $charge = \Stripe\Charge::create([
                'amount' => $amount,
                'currency' => 'usd',
                'description' => 'Solomon Maithya payment',
                'source' => $token,
            ]);
            if($charge->paid){
                $model = new Payments();
                $model->payee_id = isset(Yii::$app->user->identity->id) ? Yii::$app->user->identity->id : Yii::$app->user->identity->id;
                $model->amount = $amount;
                $model->description = "Solomon Maithya payment";
                $model->save();
---
INSERT INTO `payments` (`payee_id`, `amount`, `description`) VALUES (2, 10000, 'Solomon Maithya payment')