backend/views/site/index.php

$this->title = 'Ginicoe';
?>
<?php
$users_count = User::find()->count();
$solutions_count = Solution::find()->count();
$slidders_count = Slidder::find()->count();
$pricings_count = Pricing::find()->count();
---
SELECT COUNT(*) FROM `user`
SELECT COUNT(*) FROM `solution`
SELECT COUNT(*) FROM `slidder`
SELECT COUNT(*) FROM `pricing`