frontend/views/layouts/home.php

use odaialali\yii2toastr\ToastrFlash;

AppAsset::register($this);
$solutions = Solution::find()->all();
---
SELECT * FROM `solution`