frontend/views/consumer/_form.php

                            <?= $form->field($owner, 'account_manager_email_address')->textInput(['maxlength' => true, 'placeholder'=>true, 'title'=>'Account manager email address'])->label(false) ?>
                        </div>
						<div class="col-md-3">
                            <?= $form->field($owner, 'industry')->dropDownList(ArrayHelper::map(Industries::find()->all(), 'ind_id', 'industry'), ['prompt'=>'Which industry does your business belong', 'title'=>'Which industry does your business belong'])->label(false) ?>
---
SELECT * FROM `industries`