backend/views/pricing/_form.php

SELECT * FROM `solution`
---

<div class="pricing-form">
 <?php
    $countries=Solution::find()->all();