frontend/views/site/index.php

SELECT * FROM `solution`
---
use backend\models\Slidder;

$this->title = 'Ginicoe Inc | Home';
$solutions = Solution::find()->all();

SELECT * FROM `slidder` ORDER BY `id` DESC
---
                    </div>
                </div>
                <div class="item active">
                    <div class="slider-thumb bg-fixed" style="background-image: url(<?= Yii::$app->request->baseUrl ?>admin/<?= Slidder::find()->orderBy(['id' => SORT_DESC])->one() ? Slidder::find()->orderBy(['id' => SORT_DESC])->one()->image : null?>);"></div>