frontend/views/site/signup.php


                            <?= $form->field($model, 'username')->textInput(['autofocus' => true]) ?>

                            <?= $form->field($model, 'user_type')->dropDownList(ArrayHelper::map(UserTypes::find()->all(), 'type_id', 'user_type'), ['prompt'=>'Select Category']) ?>
---
SELECT * FROM `user_types`